20240302T024538--kdoc-118-ハックできる認知範囲を増やす__essay.org
:properties:
:ID: 20240302T024538
:end:
#+title:      KDOC 118: ハックできる認知範囲を増やす
#+date:       [2024-03-02 Sat 02:45]
#+filetags:   :essay:
#+identifier: 20240302T024538

* この文書のステータス
- 作成
  - [X] 2024-03-13 貴島
- レビュー
  - [X] 2024-04-01 貴島

* アイデア
[[id:fa497359-ae3f-494a-b24a-9822eefe67ad][System Crafters]]のEmacsパッケージ紹介ライブ配信を見て、まだ見たことのない最近めのパッケージが多数公開されているのを知った。いかしたパッケージをいくつも作っている人がいて、憧れる。

何が必要なんだろうか。

- 何でもいじれる(ハックできる)知識、自信

  自由自在にいじれる感覚がないと、新しいものを生み出せないように見える。知らないと、狭い枠の中でしか考えられない。枠を認識できない。独創的なものは枠を作り変えるようなもので、枠を認識できる必要がある。

- アイデア

  といっても、完全にゼロからのアイデアではない。ドキュメントなどを見るとほかのものから着想を得て、というパターンは多いように見えた。ほかの人が作るいかしたものへのアンテナと、それを[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]に落とし込む普段の思考が重要そうに見えた。

あたりだろうか。つまりハックできる認知範囲を増やしつつ、ほかの人が生み出したアイデアに注意を払うということだ。

* 関連
- [[id:20240302T015305][KDOC 117: spacious-padding.elが最高だった]]。素晴らしいパッケージのひとつ
