20240302T024538--kdoc-118-ハックできる認知範囲を増やす__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:11:56Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 118: ハックできる認知範囲を増やす</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 118: ハックできる認知範囲を増やす</h1>
<div id="outline-container-org25aaaee" class="outline-2">
<h2 id="org25aaaee"><a href="#org25aaaee">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org25aaaee">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-03-13 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-01 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7a474b5" class="outline-2">
<h2 id="org7a474b5"><a href="#org7a474b5">アイデア</a></h2>
<div class="outline-text-2" id="text-org7a474b5">
<p>
<a href="20210915221421-systemcrafters.html#ID-fa497359-ae3f-494a-b24a-9822eefe67ad">System Crafters</a>のEmacsパッケージ紹介ライブ配信を見て、まだ見たことのない最近めのパッケージが多数公開されているのを知った。いかしたパッケージをいくつも作っている人がいて、憧れる。
</p>

<p>
何が必要なんだろうか。
</p>

<ul class="org-ul">
<li><p>
何でもいじれる(ハックできる)知識、自信
</p>

<p>
自由自在にいじれる感覚がないと、新しいものを生み出せないように見える。知らないと、狭い枠の中でしか考えられない。枠を認識できない。独創的なものは枠を作り変えるようなもので、枠を認識できる必要がある。
</p></li>

<li><p>
アイデア
</p>

<p>
といっても、完全にゼロからのアイデアではない。ドキュメントなどを見るとほかのものから着想を得て、というパターンは多いように見えた。ほかの人が作るいかしたものへのアンテナと、それを<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>に落とし込む普段の思考が重要そうに見えた。
</p></li>
</ul>

<p>
あたりだろうか。つまりハックできる認知範囲を増やしつつ、ほかの人が生み出したアイデアに注意を払うということだ。
</p>
</div>
</div>
<div id="outline-container-org9169c8f" class="outline-2">
<h2 id="org9169c8f"><a href="#org9169c8f">関連</a></h2>
<div class="outline-text-2" id="text-org9169c8f">
<ul class="org-ul">
<li><a href="20240302T015305--kdoc-117-spacious-paddingelが最高だった__essay.html#ID-20240302T015305">KDOC 117: spacious-padding.elが最高だった</a>。素晴らしいパッケージのひとつ</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
